name: "flux1_service"
backend: "python"

max_batch_size: 4

input [
  {
    name: "prompt"
    data_type: TYPE_STRING
    dims:  [1]
  }
]

output [
  {
    name: "output_image"
    data_type: TYPE_UINT8
    dims: [ -1, -1, -1, 3 ]  # Batch, Height, Width, RGB channels
  }
]

instance_group [
  {
    count: 2
    kind: KIND_GPU
  }
]

dynamic_batching {
  preferred_batch_size: [2]
  max_queue_delay_microseconds: 100000 # 0.1s
}
